/* ------------------------------------------------------------------------------
問題文
2つの整数A, Bが与えられる。
A+Bの計算結果を出力してください。

サンプルプログラム
#include <bits/stdc++.h>
using namespace std;
 
int main() {
  // ここにプログラムを追記
}

制約
0≦A,B≦100
A,Bは整数

入力
入力は次の形式で標準入力から与えられます。
A B

出力
A+Bの計算結果を出力してください。出力の最後には改行が必要です。
--------------------------------------------------------------------------------*/

#include <bits/stdc++.h>
using namespace std;
 
int main() {
  int A, B;
  cin >> A >> B;
  cout << A + B << endl;
}