//1000以下の素数を列挙せよ

//素数：自分自身と1以外の整数で割り切れない → 2からn-1までのいずれの整数でも割り切れない
//(参考) 合成数 : 素数の否定

class PrimeNumber1 {
    //出力
    pubic static void main(String[] args) {
        for(int n = 2; n <= 1000; n++) {//割られる数
            int i;
            for(i = 2; i < n; i++) {//割る数
                if(n % i == 0) {//割り切れたらそこで終了
                    break;
                }
            }
            if(n == i) {//最後まで割り切れなかったので出力
                System.out.println(n);
            }
        }
    }
}

//nが2や3で割り切れなければ、2*2(=4)や2*3(=6)で割り切れることはない
//つまり、2からn-1のいずれの「素数」で割り切れないことを確認するだけでよい
//⇒ PrimeNumber2.javaで改良